backend/artillery/userloadtest.yml
config:
  target: 'http://localhost:8000'
  phases:
    # - duration: 10
    #   arrivalRate: 5
    #   name: Test
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 35
      name: Ramp up load
    - duration: 600
      arrivalRate: 35
      name: Sustained load
  payload:
    - path: "users.csv"
      fields:
      - "username"
      - "email"
      - "password"
      - "firstName"
      - "lastName"
      - "birthDate"
    - path: "newUsers.csv"
      fields:
      - "_id"
      - "newUsername"
      - "newEmail"
      - "newPassword"
      - "newFirstName"
      - "newLastName"
      - "newBirthDate"
      - "newReports"
      - "newCredit"
      - "newRole"
      - "newIsDeleted"
      - "newCardDetails"
      - "newActivationDate"
      - "newBanUntil"
    - path: "newCardDetails.csv"
      fields:
      - "newCardNumber"
      - "newExpiryDate"
      - "newCvv"
      - "newNameOnCard"
      - "newAddressLine1"
      - "newCity"
      - "newCounty"
      - "newPostcode"
      - "newCountry"
before:
  flow:
    - log: 'Get user auth tokens'
    - post:
        url: "/user/signin"
        json: 
          username: "user"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "user_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "user_data"
        headers: 
          Cookie: "{{ user_token }}"
    - post:
        url: "/user/signin"
        json: 
          username: "admin"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "admin_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "admin_data"
        headers: 
          Cookie: "{{ admin_token }}"
    - post:
        url: "/user/signin"
        json: 
          username: "broker"
          password: "Password1!"
        capture:
          header: "set-cookie"
          as: "broker_token"
    - post:
        url: "/user/validate"
        capture:
          json: "$"
          as: "broker_data"
        headers: 
          Cookie: "{{ broker_token }}"
    - log: "user token: {{ user_token }}"
    - log: "admin token: {{ admin_token }}"
    - log: "broker token: {{ broker_token }}"
scenarios:
- name: "Get all users"
  flow:
    - get:
        url: "/user/all"
        headers: 
          Cookie: "{{ admin_token }}"
- name: "Get one user"
  flow:
    - get:
        url: "/user/one?username=user"
        headers: 
          Cookie: "{{ admin_token }}"
- name: "Validate user token"
  flow:
    - post:
        url: "/user/validate"
        headers: 
          Cookie: "{{ user_token }}"
- name: "Edit user details"
  flow:
    - post:
        url: "/user/edit"
        json: 
          username: "{{ user_data.username }}"
          firstName: "{{ firstName }}"
        headers: 
          Cookie: "{{ admin_token }}"
- name: "Sign out user"
  flow:
    - get:
        url: "/user/signout"
        headers: 
            Cookie: "{{ user_token }}"


# leave commented
# - name: "Add new credit card"
#   flow:
#     - post:
#         url: "/user/credit-card"
#         json: 
#           userId: "{{ user_data.id }}"
#           cardDetails:
#             cardNumber: "{{ newCardNumber }}"
#             expiryDate: "{{ newExpiryDate }}"
#             cvv: "{{ newCvv }}"
#             nameOnCard: "{{ newNameOnCard }}"
#             addressLine1: "{{ newAddressLine1 }}"
#             city: "{{ newCity }}"
#             county: "{{ newCounty }}"
#             postcode: "{{ newPostcode }}"
#             country: "{{ newCountry }}"
#         headers: 
#           Cookie: "{{ user_token }}"
# - name: "Password Reset Request Request"
#   flow:
#     - post:
#         url: "/user/password-reset-request"
#         json: 
#           email: "{{ user_data.email }}"
#         headers: 
#           Cookie: "{{ user_token }}"
# - name: "Register user"
#   flow:
#     - post:
#         url: "/user/register"
#         json: 
#           username: "{{ username }}"
#           email: "{{ email }}"
#           firstName: "{{ firstName }}"
#           lastName: "{{ lastName }}"
#           birthDate: "{{ birthDate }}"
#           password: "{{ password }}"
# - name: "Activate user"
#   flow:
#     - post:
#         url: "/activate"
#         json: 
#           username: "{{ username }}"
#           password: "{{ password }}"
#           token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJpZCI6IjYyZWZlMTNmZTA4YmIzNzYyY2U1YTdjYiIsInVzZXJuYW1lIjoiYWRtaW4iLCJlbWFpbCI6ImFkbWluQHN0b2NrdHJhZGluZ3N5c3RlbS5jb20iLCJmaXJzdE5hbWUiOiJBZG1pbiIsImxhc3ROYW1lIjoiQWNjb3VudCIsInJlcG9ydHMiOltdLCJjcmVkaXQiOjUwMDAwLCJyb2xlIjoiQWRtaW4iLCJpc0RlbGV0ZWQiOmZhbHNlLCJjYXJkRGV0YWlscyI6W10sInBhc3N3b3JkIjoiIiwiYWN0aXZhdGlvbkRhdGUiOiIyMDIyLTA4LTA3VDE1OjU4OjU1LjYwM1oiLCJpYXQiOjE2NTk4OTI5NjMsImV4cCI6MTY2MDQ5Nzc2M30.xTl-ipbyrno7HBbNVcNhoVA8NNflfXfHlbF-a7ox7Xs"
# - name: "Request deactivation"
#   flow:
#     - post:
#         url: "/signin"
#         json: 
#           username: "user"
#           password: "Password1!"
#         jar: true
#     - post:
#         url: "/requestdeactivation"
#         json: 
#           username: "{{ username }}"
#           password: "{{ password }}"
# - name: "Sign in user"
#   flow:
#     - post:
#         url: "/signin"
#         json: 
#           username: "{{ username }}"
#           password: "{{ password }}"
# - name: "Password Reset"
#   flow:
#     - post:
#         url: "/password-reset"
#         json: 
#           key: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InVzZXJAc3RvY2t0cmFkaW5nc3lzdGVtLmNvbSIsInJlcXVlc3REYXRlIjoiU2F0IEp1bCAyMyAyMDIyIDEyOjUxOjAyIEdNVCswMTAwIChCcml0aXNoIFN1bW1lciBUaW1lKSJ9.-Gk6FSneiFdfni_TExzCK-xVpbGIxGSuhf3ekwS0smc"
#           password: "{{ password }}"