backend/artillery/userloadtest.yml
config:
  target: 'https://localhost:8000/user'
  phases:
    - duration: 60
      arrivalRate: 5
      name: Warm up
    - duration: 120
      arrivalRate: 5
      rampTo: 50
      name: Ramp up load
    - duration: 600
      arrivalRate: 50
      name: Sustained load
  payload:
    path: "users.csv"
    fields:
      - "_id"
      - "username"
      - "email"
      - "password"
      - "firstName"
      - "lastName"
      - "birthDate"
      - "reports"
      - "credit"
      - "role"
      - "isDeleted"
      - "cardDetails"
      - "activationDate"
      - "banUntil"
  
scenarios:
- name: "Password Reset"
  flow:
    - get:
        url: "/password-reset"
        json: 
          key: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJlbWFpbCI6InVzZXJAc3RvY2t0cmFkaW5nc3lzdGVtLmNvbSIsInJlcXVlc3REYXRlIjoiU2F0IEp1bCAyMyAyMDIyIDEyOjUxOjAyIEdNVCswMTAwIChCcml0aXNoIFN1bW1lciBUaW1lKSJ9.-Gk6FSneiFdfni_TExzCK-xVpbGIxGSuhf3ekwS0smc"
          password: "{{ password }}"
- name: "Password Reset Request Request"
  flow:
    - get:
        url: "/password-reset-request"
        json: 
          email: "{{ email }}"
- name: "Test error"
  flow:
    - get:
        url: "/test-error"
- name: "Get all users"
  flow:
    - get:
        url: "/all"
        cookie:
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJyb2xlIjoiQWRtaW4ifQ.eWPKdazMo3apas2nxUDq2H5Kx3Pw5_PTO-szXmylZ3w"
- name: "Get one user"
  flow:
    - get:
        url: "/one"
        json: 
          username: "{{ username }}"
        cookie:
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJyb2xlIjoiQWRtaW4ifQ.eWPKdazMo3apas2nxUDq2H5Kx3Pw5_PTO-szXmylZ3w"
- name: "Sign in user"
  flow:
    - get:
        url: "/signin"
        json: 
          username: "{{ username }}"
          password: "{{ password }}"
        cookie:
          token: "eyJhbGciOiJIUzI1NiIsInR5cCI6IkpXVCJ9.eyJyb2xlIjoiQWRtaW4ifQ.eWPKdazMo3apas2nxUDq2H5Kx3Pw5_PTO-szXmylZ3w"